ДСУтест/src/Reports/ИсторияКурсовВалют/ИсторияКурсовВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИсторияКурсовВалют</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

ДСУтест/src/Reports/ИсторияКурсовВалют/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПриИзмененииПараметраОтбора(Элемент)
	
	Если Элемент.Имя = "НачалоПериода" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.НачалоПериода);
	ИначеЕсли Элемент.Имя = "КонецПериода" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.КонецПериода);
	ИначеЕсли Элемент.Имя = "Валюта" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.Валюта);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрОтбора(Имя, Значение)
	
	Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра(Имя, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбораВалют = ПолучитьФорму("Справочник.Валюты.ФормаВыбора", Новый Структура("НеПоказыватьОсновнуюВалютуУчета", Истина));
	
	РезультатВыбора = ФормаВыбораВалют.ОткрытьМодально();
	
	Если РезультатВыбора <> Неопределено Тогда
		Отчет.Валюта = РезультатВыбора;
	КонецЕсли;	
	
КонецПроцедуры
